somc_migrate_multiverse_to_bungeecord.md


<a id="org8b917db"></a>

## Start the Server and make in world changes

1.  Start the minecraft servers
    
        docker-compose up -d
2.  Login into the game.
3.  Make the portals to connect worlds
    -   Head to location for portal in game
    -   Place dirt within portal frame at clickable locations
    -   Run the command `/portals sm`
    -   Right-click position one and left-click position two of the portal
    -   Create the portal with `/portals create world1_to_world2` (adjust name as needed)
    -   Link the portals `/portals ss world1_to_world2 world2` (adjust as needed)
4.  Update permissions to allow players to use the portals.
    -   Switch to world 1 with `/server world1`
    -   Open the luck perms editor `/luckperms editor` and click link
    -   Under the default group add **simpleportals.portals.** \* as **true**
    -   Switch to world 2 with `/server world2`
    -   repeat steps b and c


<a id="orgc4f654e"></a>

# Adding a Lobby and Using it to Enforce Whitelist

Adding a lobb provides a couple of main benifits:

-   The whitelist can be enforced in on place across the network.
-   Players can change worlds by logging into the game instead of
    having to travel back to spawn of their current world and then
    using a portal to a new world. Allowing them to save their 
    location per world.

To this we are going to add a super flat, migrate the whitelist, and force
entry to the lobby server.

1.  Open **docker-compose.yml** file.
    
        emacs docker-compose.yml
2.  Under the **volumes** section craete a new volume for the lobby
    
        volumes:
          somc-lobby:
          [...]
3.  Under the **serviecs** section add the lobby server.
    
        services: 
          somc-lobby:
            image: itzg/minecraft-server
            restart: always
            volumes:
              - "somc-lobby:/data"
            environment:
              EULA: "TRUE"
        
              TYPE: "SPIGOT"
              VERSION: "1.20.1"
        
              MEMORY: 3G
              VIEW_DISTANCE: 10
              MAX_PLAYERS: 50
        
              WHITELIST: "WindMagi"
              OPS: "WindMagi"
        
              MODE: "adventure"
              DIFFICULTY: "peaceful"
              MAX_WORLD_SIZE: 500
              ALLOW_NETHER: "FALSE"
              FORCE_GAMEMODE: "TRUE"
              GENERATE_STRUCTURES: "FALSE"
              SPAWN_ANIMALS: "FALSE"
              SPAWN_MONSTERS: "FALSE"
              SPAWN_NPCS: "FALSE"
        
              LEVEL_TYPE: FLAT
        
              ONLINE_MODE: "FALSE"
        
              MOTD: "SoMC: Social and Minecraft"
              ANNOUNCE_PLAYER_ACHIEVEMENTS: "FALSE"
              SNOOPER_ENABLED: "FALSE"
        
              LEVEL: world
4.  Create symbolic link to to make accessing the data directory easier.
    
        ln -s /var/lib/docker/volumes/minecraft_somc-lobby/_data/ somc-lobby
5.  Start the new lobby server
    \#+begin-src sh
    docker-compose up -d
    \#+end<sub>src</sub>
6.  In **somc-lobby/spigot.yml** set **bungeecord** to **true**.
7.  In **somc-lobby/bukkit.yml** set **connection-throttle** to **-1**
8.  In **somc-proxy/confgi.yml**, add the new server under the **servers** section
    
        servers:
        lobby:
        motd: Lobby
        address: somc-lobby:25565
        restricted: false
9.  In **somc-proxy/confgi.yml**, **force<sub>default</sub><sub>server</sub>** and set it to **true**
10. In **somc-proxy/confgi.yml**, under **priorities** remove all entries and make it look like:
    
        priorities:
        - lobby
11. Copy the whitelist from the orginal data directory
    
        cp data/whitelist.josn somc-lobby/
12. Install the Plugins Simple Portals, ViaVersion, ViaBackwards, LuckPerms
    
        cp SimplePortals-*.jar somc-lobby/plugins/
        cp data/plugins/Via*.jar somc-lobby/plugins/
        cp data/plugins/LuckPerms*.jar somc-lobby/plugins/
13. Restart the lobby and the proxy
    
        docker-compose restart somc-lobby somc-proxy
14. Login into the game and make sure you are in the lobby world
15. Adjust some gamerulse
    -   doDaylightCycle false
    -   doWeatherCycle false
16. Make the portals to connect each world
    -   Create a portal frame
    -   Place dirt within portal frame at clickable locations
    -   Run the command `/portals sm`
    -   Right-click position one and left-click position two of the portal
    -   Create the portal with `/portals create to_worl1` (adjust name as needed)
    -   Link the portals `/portals ss to_world1 world1` (adjust as needed)
17. Update permissions to allow players to use the portals.
    -   Open the luck perms editor `/luckperms editor` and click link
    -   Under the default group add **`simpleportals.portal.*`** as **true**
18. In the **docker-compose.yml** remove the whitelist value under somc-world1 and somc-world2.
19. Remove the whitelist files
    
        rm somc-world1/whitelist.json
        rm somc-world2/whitelist.json
20. Edit the **server.properties** for each world and set:
    -   white-list = false
    -   enforce-whitelist = false
21. Restart the world servers
    
        docker-compose up -d


<a id="org527be2b"></a>

# Enabling Backups

**Note:** This will assume that you have an ssh config setup to allow for
access to a server called `backup`. We also assume that a folder called ssh
exists with a config and private key that can be used with the backup
dockers.

1.  Ensure the **somc-backup** instance is no longer running and 
    remove it from the docker-compose.yml.
2.  Move the existing borg backup folder into a legacy state
    
        ssh backup mv somc somc-legacy
3.  Create new borg repos for each of the serverrs.
    
        ssh backup mkdir SoMC
        borg init --encryption=repokey backup:SoMC/proxy
        borg init --encryption=repokey backup:SoMC/lobby
        borg init --encryption=repokey backup:SoMC/world1
        borg init --encryption=repokey backup:SoMC/world2
4.  Add 4 new backup services
    
        services:
          somc-proxy-backup:
            image: dmgarvis/minecraft-backup
            restart: always
            environment:
              BORG_REPO: remote_backup:SoMC/proxy
              BORG_PASSPHRASE: (omitted)
              BORG_REMOTE_PATH: borg1
            volumes:
              - somc-proxy:/data:ro
              - ./ssh:/root/.ssh
          somc-lobby-backup:
            image: dmgarvis/minecraft-backup
            restart: always
            environment:
              BORG_REPO: remote_backup:SoMC/lobby
              BORG_PASSPHRASE: (omitted)
              BORG_REMOTE_PATH: borg1
            volumes:
              - somc-lobby:/data:ro
              - ./ssh:/root/.ssh
          somc-world1-backup:
            image: dmgarvis/minecraft-backup
            restart: always
            environment:
              BORG_REPO: remote_backup:SoMC/world1
              BORG_PASSPHRASE: (omitted)
              BORG_REMOTE_PATH: borg1
            volumes:
              - somc-world1:/data:ro
              - ./ssh:/root/.ssh
          somc-world2-backup:
            image: dmgarvis/minecraft-backup
            restart: always
            environment:
              BORG_REPO: remote_backup:SoMC/world2
              BORG_PASSPHRASE: (omitted)
              BORG_REMOTE_PATH: borg1
            volumes:
              - somc-world2:/data:ro
              - ./ssh:/root/.ssh
5.  Now you should be able to start the new backup instances
    \#+bgein<sub>src</sub> sh
    docker-compose up -d
    \#+end<sub>src</sub>
